
export const getItemInfo = (params) => {
  return Promise.resolve(
    {
      "message": "成功",
      "tcId": "1de66f6a48364746bc6b16e561b51524.151.16207012136048221",
      "respCode": "100",
      "data": {
        "intro": "文字说明 20个字文字说明 最多 20个",
        "details": [{ "desc": "完成1次练习", "score": 1, "remark": "" },
        { "desc": "完成1次错题相似题练习", "score": 2, "remark": "" },
        { "desc": "完成1个视频观看", "score": 3, "remark": "" },
        { "desc": "完成1个推荐学习资源浏览", "score": 4, "remark": "" },
        { "desc": "完成1个专属课程", "score": 5, "remark": "" },
        { "desc": "每完成1个专属课程", "score": 6, "remark": "" },
        { "desc": "每个专属课程前5名完成的", "score": 7, "remark": "" },
        { "desc": "训练营前5名完成的", "score": 8, "remark": "" },
        { "desc": "单次练习正确率达到50%", "score": 9, "remark": "含主观题的练习，需教师批改后再计算正确率" },
        { "desc": "分享1名好友参加训练营", "score": 10, "remark": "学员分享专属课程成就图，结业证书，排行榜；好友通过分享加入训练营且完成了1个专属课程，学员获得积分" }]
      },
      "code": 100
    }
  )
}

export const getItemDetailInfo = (params) => {
  return Promise.resolve(
    {
      "message": "成功",
      "tcId": "1de66f6a48364746bc6b16e561b51524.151.16207012136048221",
      "respCode": "100",
      "data": {
        "intro": "文字说明 20个字文字说明 最多 20个",
        "details": [
          { "desc": "单次练习正确率大于等于90%", "score": 1, "remark": "", "time": "04-06 12:00" },
          { "desc": "单次练习正确率大于等于90%", "score": 2, "remark": "", "time": "04-06 12:00" },
          { "desc": "单次练习正确率大于等于90%", "score": 3, "remark": "", "time": "04-06 12:00" },
          { "desc": "完成1个推荐学习资源浏览", "score": 4, "remark": "", "time": "04-06 12:00" },
          { "desc": "完成1个专属课程", "score": 5, "remark": "", "time": "04-06 12:00" },
          { "desc": "单次练习正确率大于等于90%", "score": 6, "remark": "", "time": "04-06 12:00" },
          { "desc": "每个专属课程前5名完成的", "score": 7, "remark": "", "time": "04-06 12:00" },
          { "desc": "训练营前5名完成的", "score": 8, "remark": "", "time": "04-06 12:00" },
          { "desc": "单次练习正确率大于等于90%", "score": 9, "remark": "含主观题的练习，需教师批改后再计算正确率", "time": "04-06 12:00" },
          { "desc": "单次练习正确率大于等于90%", "score": 9, "remark": "含主观题的练习，需教师批改后再计算正确率", "time": "04-06 12:00" },
          { "desc": "单次练习正确率大于等于90%", "score": 9, "remark": "含主观题的练习，需教师批改后再计算正确率", "time": "04-06 12:00" },
          { "desc": "单次练习正确率大于等于90%", "score": 9, "remark": "含主观题的练习，需教师批改后再计算正确率", "time": "04-06 12:00" },
          { "desc": "单次练习正确率大于等于90%", "score": 9, "remark": "含主观题的练习，需教师批改后再计算正确率", "time": "04-06 12:00" },
          { "desc": "单次练习正确率大于等于90%", "score": 9, "remark": "含主观题的练习，需教师批改后再计算正确率", "time": "04-06 12:00" },
          { "desc": "分享1名好友参加训练营", "score": 10, "remark": "学员分享专属课程成就图，结业证书，排行榜；好友通过分享加入训练营且完成了1个专属课程，学员获得积分", "time": "04-06 12:00" }
        ]
      },
      "code": 100
    }
  )
}
